# -*- coding: utf-8 -*-
from util2 import calc_A1, calc_A2


p  = 2**30 - 1 #некое очень большое число

#для первого задания
a1 = p - 1
a2 = p - 2
a3 = p - 3
a4 = p - 4
a5 = p - 5

if __name__ == '__main__':

	print '\n------Вычисляем A1--------------'	
	#первая часть задачи
	A1, A2, A3, A4, A5, A6, A7, A8, A9, A10, A11 = calc_A1(a1, a2, a3, a4, a5)
	print 'Кортеж A1: %i, %i, %i, %i, %i, %i, %i, %i, %i, %i, %i' % (A1, A2, A3, A4, A5, A6, A7, A8, A9, A10, A11)
	print '------Вычисление A1 завершено------'

	print '\n------Вычисляем A2-----------------'

	#вторая часть задачи
	print 'Кортеж A2: %i, %i, %i, %i' % calc_A2(A1, A2, A3, A4, A5, A6, A7, A8, A9, A10, A11, p)
	
	print '------Вычисление A2 завершено------\n'