# -*- coding: utf-8 -*-
from util2 import calc_A1, calc_A2, calc_A3, calc_A4


p  = 2**30 - 1 #некое очень большое число

#для первой части задания
a1 = p - 1
a2 = p - 2
a3 = p - 3
a4 = p - 4
a5 = p - 5

if __name__ == '__main__':

	print '\n------Вычисляем кортеж A1(11 элементов)---'	
	A1, A2, A3, A4, A5, A6, A7, A8, A9, A10, A11 = calc_A1(a1, a2, a3, a4, a5)
	print 'Кортеж A1: %i, %i, %i, %i, %i, %i, %i, %i, %i, %i, %i' % (A1, A2, A3, A4, A5, A6, A7, A8, A9, A10, A11)
	print '------Вычисление A1 завершено---------------'

	print '\n------Вычисляем кортеж A2(4 элемента)-----'
	A1_, A2_, A3_, A4_ = calc_A2(A1, A2, A3, A4, A5, A6, A7, A8, A9, A10, A11, p)
	print 'Кортеж A2: %i, %i, %i, %i' % (A1_, A2_, A3_, A4_)	
	print '--------Вычисление A2 завершено------\n'

	print '\n------Вычисляем кортеж A3(9 элементов)-----'
	print 'Кортеж A3: %i, %i, %i, %i, %i, %i, %i, %i, %i' % calc_A3(A10, A2, A3, A4_)	
	print '--------Вычисление A3 завершено------\n'

	print '\n------Вычисляем кортеж A4(5 элементов)-----'
	print 'Кортеж A4: %i, %i, %i, %i, %i' % calc_A4(A4_, A2, A3, A8, A1_)	
	print '--------Вычисление A4 завершено------\n'	